//
//  EventHome.swift
//  proj002
//
//  Created by utaipei on 2018/2/4.
//  Copyright © 2018年 utaipei. All rights reserved.
//

import UIKit
import Firebase
import FirebaseDatabase

class EventHome: UIViewController, UITableViewDelegate,UITableViewDataSource, UIPickerViewDelegate, UIPickerViewDataSource {
  
    
    
    @IBAction func backToEventHome(segue: UIStoryboardSegue){}
    
    //PickerView
    @IBOutlet weak var categoryPicker: UIPickerView!
    let categoryData = ["推薦","收藏","追蹤"]
    
    func numberOfComponents(in pickerView: UIPickerView) -> Int {
        return 1
    }
    
    func pickerView(_ pickerView: UIPickerView, numberOfRowsInComponent component: Int) -> Int {
        return categoryData.count
    }
    
    func pickerView(_ pickerView: UIPickerView, titleForRow row: Int, forComponent component: Int) -> String? {
        return categoryData[row]
    }
    
    //TableView
    var eventData:[String] = ["2017東亞數學史國際研討會","106年度蘋果節「蘋安喜樂」演唱會暨閉幕典禮","臺北市立大學 畢聯會「大發辦桌會」","1052教師精進研習工作坊(LMS教學)","市立動物園金仕謙園長講座 主題[動物園的保育使命]","臺灣史製作團隊講座 主題【臺灣吧：打造新的學習世界】","南投縣立爽文國中王政忠教導主任 主題【我有一個夢】","教育部師資課程教學與評量協作中心規劃委員汪履維教授 主題【十二年國教的課程教學與評量:改革新動向】","美感細胞教育改革計畫陳慕天先生 主題【社會創新】","教學助理培訓-微電影剪輯技巧","105學年度第2學期輔導教師座談會議","「與時代接軌—影像製作接軌So Fun」-影像剪接入門及混音","「與時代接軌—影像製作接軌So Fun」-雙機影像剪輯及字幕效果","「與時代接軌—影像製作接軌So Fun」-影像特效及輸出成品","舉行105學年度第2學期全校教師教學研 討會","教學助理培訓-微電影剪輯技巧","臺北市立大學105學年度第2學期理學院數學系科學大師週末研習-統計","【教師精進研討】通識教育這條路─教學經驗分享與省思","【教師精進研討】數位教學課程線上經營經驗分享","教學助理培訓-口語表答關鍵力","教學助理培訓-時間管理","善用 EverCam ~ 教學可以更輕鬆、有效!","產學合作工作坊","產學合作工作坊(4月25日場)","教學助理培訓-Illustrator 很簡單","106年度資訊安全暨個人資料檔案清冊盤點暨風險評鑑教育訓練第一梯次(天母校區)","106年度資訊安全暨個人資料檔案清冊盤點暨風險評鑑教育訓練第二梯次(博愛校區)","ZUVIO 雲端即時反饋系統","106年一般環境安全衛生講習","教學助理培訓-Illustrator 很簡單","教育系105學年度教育部補助精進師資素質計畫「國民小學適性教學工作坊：模擬教甄」","「教育學講座」 單文經教授演講：杜威教育思想今詮","「通識教育與語文教學」暨106學年度第1學期通識教師精進研討會","106學年度第1學期教師教學工作坊","邱培榮 創意總監/晶舜設計工程公司 講題:【展示設計與品牌精神】","李雨珊 總經理/墨色國際 講題:【從幾米到幾米品牌-幾米品牌的經營策略與創意】","王俊秀 教授/國立清華大學 講題:【SD to SD:共善作為地球之道】","卜袞‧伊斯瑪哈單‧伊斯立端 先生/布農族詩人 講題:【談族語文學創作】","劉瑞玲 部主任/臺北榮民總醫院眼科部 講題:【現代人常見眼疾及未來隱憂】","陳致宏 博士/德國 維藤·赫德克大學 講題:【從德國民族主義與德國人對古代歷史的觀點談起】","106-1教師教學工作坊-新進教師如何準備教師評鑑","讓Apple創造你的無限想像","用Mac開始你的創新應用","用Keynote讓你的簡報獨一無二","用iMovie讓你的影片有聲有色","用iPad開始你的行動教學","用iPad翻轉你的教室,你的課堂","G-Suite For Education 雲端應用","告別乾燥～冬季保養品DIY","冬至一起搓湯圓～「哩麥皂！！」","醒腦大作戰 萬金油DIY 還可以防蚊喔！","矽(珪)藻土吸水杯墊－吸濕又除臭","乾洗手DIY 病菌不要來！","WIX網頁輕鬆學","106-1教職員工輔導知能研習-情感教育講座之「如何與學生們，談”情”說”愛”」","如何完成期末海報","簡報技巧與規劃實務訓練","ZUVIO雲端即時系統教學","EverCam & ee-class輕鬆學","「多媒！多美！多媒體科技新手上路！」","攝影棚好好玩","自我激勵與潛能發展管理","106學年度第1學期全校教師教學研習會","膝關節運動傷害防制與科技輔助","膝關節退化的預防與保養方針","運動傷害與防護：輕輕鬆鬆 擺脫痠痛","手機植物攝影","認識你的身體～身體組成分析測量III","台北風華，深度旅行","運動效能護具與服飾裝備開發趨勢","健身產品設計與產學合作經驗分享","跑步傷痛防護大調查及自我療護","亞洲運動保健產業市場發展趨勢","天母校區106-1心肺復甦術訓練班","第二期iOS APP跨領域合作課程","畢聯會系列講座 系列二：熱血"]
    var data2 = ["數學系","課外活動組","課外活動組","教師專業成長組","學習與媒材設計學系","學習與媒材設計學系","學習與媒材設計學系","學習與媒材設計學系","學習與媒材設計學系","教學發展中心","生活輔導組","教學發展中心","教學發展中心","教學發展中心","教師專業成長組","教學發展中心","數學系","通識教育中心","通識教育中心","教學發展中心","教學發展中心","教學發展中心","研究發展處","研究發展處","教學發展中心","計算機與網路中心","計算機與網路中心","教學發展中心","人事室","教學發展中心","教育學系","教育學系","通識教育中心","教師專業成長組","學習與媒材設計學系","學習與媒材設計學系","學習與媒材設計學系","學習與媒材設計學系","學習與媒材設計學系","學習與媒材設計學系","教學發展中心","理學院","理學院","理學院","理學院","理學院","理學院","理學院","理學院","理學院","理學院","理學院","理學院","教學發展中心","分區學務組","教學發展中心","教學發展中心","教學發展中心","教學發展中心","教學發展中心","教學發展中心","教學發展中心","教學發展中心","理學院","理學院","理學院","理學院","理學院","國際事務處","運動器材科技研究所","運動器材科技研究所","運動器材科技研究所","運動器材科技研究所","分區學務組","臺北市立大學 教學發展中心計畫辦公室","畢聯會"]
    var data3 = ["劉俐均","賴明慧","賴明慧","曹懷寧","范金雯","范金雯","范金雯","范金雯","范金雯","全家蓉","戴坤宏","徐美慧","徐美慧","徐美慧","曹懷寧","全家蓉","劉俐均","陳慧芬","陳慧芬","全家蓉","全家蓉","全家蓉","詹筠慈","詹筠慈","全家蓉","吳性定","吳性定","全家蓉","宋沛盈","全家蓉","簡淑怡","簡淑怡","陳慧芬","曹懷寧","范金雯","范金雯","范金雯","范金雯","范金雯","范金雯","陶中強","王蓓芸","王蓓芸","王蓓芸","王蓓芸","王蓓芸","王蓓芸","王蓓芸","王蓓芸","王蓓芸","王蓓芸","王蓓芸","王蓓芸","全家蓉","施雅芝","全家蓉","全家蓉","全家蓉","全家蓉","全家蓉","全家蓉","全家蓉","曹懷寧","王蓓芸","王蓓芸","王蓓芸","王蓓芸","王蓓芸","林宜均","陳婉菁","陳婉菁","陳婉菁","陳婉菁","賴秋君","","呂旻育"]
    var data4 = ["02-2311-3040*1913","02-23113040#1221","02-23113040#1221","24576056","02-23113040#8422","02-23113040#8422","02-23113040#8422","02-23113040#8422","02-23113040#8422","02-23113040#1862","02-23113040#1212","02-23113040#1821","02-23113040#1821","02-23113040#1821","24576056","02-23113040#    1862 ","02-2311-3040*1913","02-2311-3040*1162","02-2311-3040*1162","02-23113040#1862","02-23113040#1862","02-23113040#1862","2871-8288#7804","2871-8288#7804","02-23113040#1862","02-23113040#8512","02-23113040#8512","02-23113040#1862","02-87328662","02-23113040#1862","02-23113040*841","02-23113040*841","02-2311-3040*1162","0955313998","02-23113040#8422","02-23113040#8422","02-23113040#8422","02-23113040#8422","02-23113040#8422","02-23113040#8422","02-23113040#7647","02-23113040#8302","02-23113040#8302","02-23113040#8302","02-23113040#8302","02-23113040#8302","02-23113040#8302","02-23113040#8302","02-23113040#8302","02-23113040#8302","02-23113040#8302","02-23113040#8302","02-23113040#8302","02-23113040#1862","","02-23113040#1862","02-23113040#1862","02-23113040#1862","02-23113040#1862","02-23113040#1862","02-23113040#1862","02-23113040#1862","24576056","02-23113040#8302","02-23113040#8302","","","","","","","","","","",""]
    var data5 = ["羅院長義興","","","洪瑞鍾主任","方志華教授 ","張芬芬主任 ","高翠雲教授 ","張芬芬主任 ","葉興華教授","","","何家欣組長","何家欣組長","何家欣組長","","","王主任美娟","101年度第五屆 全國通識績優教師亞東技術學院 通識中心林智莉 副教授 ","103全國通識優良教師 銘傳大學林青蓉主任","","","","","","Amy老師","陳奕良","","","","洪瑞鍾主任","","中國文化大學師資培育中心 單文經教授 ","","Elsevier Taiwan office/Rita Ho經理 蔣禮芸組長何家欣副教授 ","邱培榮 創意總監/晶舜設計工程公司","李雨珊 總經理/墨色國際","王俊秀 教授/國立清華大學","卜袞‧伊斯瑪哈單‧伊斯立端 先生/布農族詩人","劉瑞玲 部主任/臺北榮民總醫院眼科部","陳致宏 博士/德國 維藤·赫德克大學","","","","","","","","","","","","","","","","","","","","","","","李麗晶組長 洪瑞鍾主任黃光獻老師 ","Fenny老師","Fenny老師","David老師","陳仁慈老師","馮威 老師","林文偉老師","吳承安老師","呂文恩老師","陳思安老師","孟瑋琳老師","吳芬宜老師","","KID 林柏昇"]
    var data6 = ["本校博愛校區公誠樓2樓第一會議室","臺北市立大學博愛校區操場 ","臺北市立大學博愛校區操場 ","博愛校區公誠樓401教室 ","本校公誠樓二樓第2會議室","本校公誠樓二樓第2會議室","本校公誠樓二樓第2會議室","本校公誠樓二樓第2會議室","本校公誠樓二樓第2會議室","博愛校區公誠樓515教室","公誠樓2樓第1會議廳","    公誠樓4樓G401教室 ","    公誠樓4樓G401教室 ","    公誠樓4樓G401教室 ","天母校區行政大樓C611教室","天母校區科資大樓501電腦教室","臺北市立大學（博愛校區）行政大樓5樓T506教室","    博愛校區公誠樓 ","天母校區C617","博愛校區行政大樓506教室","天母校區行政大樓509教室 ","博愛校區公誠樓402教室","公誠樓第1會議廳","科資大樓D810會議室","博愛校區公誠樓515教室","    天母校區計網中心科資大樓D501教室 ","    博愛校區計算機與網路中心公誠樓G521教室 ","博愛校區行政大樓 T509教室","本校博愛校區公誠樓2樓第2會議室","天母校區科資大樓501電腦教室","本校勤樸樓三樓教室","    本校公誠樓四樓G415研討室","天母校區行政大樓C613","博愛校區公誠樓415研討室 ","本校公誠樓二樓第2會議室","本校公誠樓二樓第2會議室","本校公誠樓二樓第2會議室","本校公誠樓二樓第2會議室","本校公誠樓二樓第2會議室","本校公誠樓二樓第2會議室","C611教室","公誠樓G509教室","公誠樓G509教室","公誠樓G509教室","公誠樓G509教室","公誠樓G509教室","公誠樓G509教室","公誠樓G509教室","科學館四樓S408","公誠樓G509教室","    科學館四樓S408 ","天母校區科資大樓501電腦教室","科學館四樓S408 ","博愛校區公誠樓515電腦教室","科資大樓D810會議室","天母校區科資大樓501電腦教室","    天母校區科資大樓501電腦教室","天母校區行政大樓c509階梯教室","博愛校區公誠樓515電腦教室","博愛校區公誠樓515電腦教室","博愛校區公誠樓510攝影棚","    博愛校區勤樸樓506教室","博愛校區藝術館A101演奏廳","    公誠樓4樓G401教室 ","    公誠樓4樓G401教室 ","    公誠樓4樓G401教室 ","公誠樓G509教室","科學館四樓S408","科學館四樓S409","公誠樓G509教室","科學館四樓S408","科學館四樓S409","科學館四樓S410","公誠樓G509教室","","博愛校區中正堂"]
    var data7 = ["本校博愛校區公誠樓2樓第一會議室","臺北市立大學博愛校區操場 ","臺北市立大學博愛校區操場 ","博愛校區公誠樓401教室 ","本校公誠樓二樓第2會議室","本校公誠樓二樓第2會議室","本校公誠樓二樓第2會議室","本校公誠樓二樓第2會議室","本校公誠樓二樓第2會議室","博愛校區公誠樓515教室","公誠樓2樓第1會議廳","    公誠樓4樓G401教室 ","    公誠樓4樓G401教室 ","    公誠樓4樓G401教室 ","天母校區行政大樓C611教室","天母校區科資大樓501電腦教室","臺北市立大學（博愛校區）行政大樓5樓T506教室","    博愛校區公誠樓 ","天母校區C617","博愛校區行政大樓506教室","天母校區行政大樓509教室 ","博愛校區公誠樓402教室","公誠樓第1會議廳","科資大樓D810會議室","博愛校區公誠樓515教室","    天母校區計網中心科資大樓D501教室 ","    博愛校區計算機與網路中心公誠樓G521教室 ","博愛校區行政大樓 T509教室","本校博愛校區公誠樓2樓第2會議室","天母校區科資大樓501電腦教室","本校勤樸樓三樓教室","    本校公誠樓四樓G415研討室","天母校區行政大樓C613","博愛校區公誠樓415研討室 ","本校公誠樓二樓第2會議室","本校公誠樓二樓第2會議室","本校公誠樓二樓第2會議室","本校公誠樓二樓第2會議室","本校公誠樓二樓第2會議室","本校公誠樓二樓第2會議室","C611教室","公誠樓G509教室","公誠樓G509教室","公誠樓G509教室","公誠樓G509教室","公誠樓G509教室","公誠樓G509教室","公誠樓G509教室","科學館四樓S408","公誠樓G509教室","    科學館四樓S408 ","天母校區科資大樓501電腦教室","科學館四樓S408 ","博愛校區公誠樓515電腦教室","科資大樓D810會議室","天母校區科資大樓501電腦教室","    天母校區科資大樓501電腦教室","天母校區行政大樓c509階梯教室","博愛校區公誠樓515電腦教室","博愛校區公誠樓515電腦教室","博愛校區公誠樓510攝影棚","    博愛校區勤樸樓506教室","博愛校區藝術館A101演奏廳","    公誠樓4樓G401教室 ","    公誠樓4樓G401教室 ","    公誠樓4樓G401教室 ","公誠樓G509教室","科學館四樓S408","科學館四樓S409","公誠樓G509教室","科學館四樓S408","科學館四樓S409","科學館四樓S410","公誠樓G509教室","","博愛校區中正堂"]
    var data8 = ["2017/2/23 9:00","2017/1/17 9:30","2017/1/17 9:30","2017/2/15 13:30","2017/3/2 18:30","2017/3/16 18:30","2017/4/27 18:30","2017/5/25 18:30","2017/6/8 18:30","2017/3/7 13:00","2017/3/28 12:00","2017/4/12 14:00","2017/4/19 14:00","2017/4/26 14:00","2017/3/21 12:00","2017/3/14 13:00","2017/4/15 8:30","2017/4/17 12:00","2017/4/18 12:00","2017/3/28 13:00","2017/4/25 13:00","2017/5/23 13:00","2017/4/24 14:00","2017/4/25 9:30","2017/4/26 9:30","2017/5/8 14:00","2017/5/11 14:00","2017/5/3 13:00","2017/6/13 9:00","2017/5/8 13:00","2017/5/24 9:30","2017/6/15 18:30","2017/9/1 9:30","2017/9/13 13:00","2017/10/12 18:30","2017/10/19 18:30","2017/11/2 18:30","2017/11/23 18:03","2017/11/30 18:30","2017/12/7 18:30","2017/10/17 13:00","2017/9/23 9:30","2017/10/2 12:00","2017/10/11 12:00","2017/10/12 12:00","2017/10/23 12:00","2017/10/24 12:00","2017/9/30 9:00","2017/11/6 12:00","2017/11/7 12:00","2017/11/8 12:00","2017/11/9 12:00","2017/11/10 12:00","2017/9/26 13:00","2017/11/8 13:00","2017/10/3 13:00","2017/10/17 13:00","2017/11/21 13:00","2017/10/2 13:00","2017/10/3 13:00","2017/11/7 13:00","2017/11/28 13:00","2017/10/24 12:00","2017/10/25 12:00","2017/11/2 18:30","2017/11/3 18:30","2017/11/4 18:30","2017/11/5 18:30","2017/11/30 18:30","2017/11/28 13:00","2017/11/29 13:00","2017/11/30 13:00","2017/12/1 13:00","2017/12/2 13:00","2018/1/23 10:00","2018/1/9 13:00"]
    var data9 = ["2017/2/23 18:00","2017/1/17 12:00","2017/1/17 12:00","2017/2/15 14:30","2017/3/2 21:30","2017/3/16 21:30","2017/4/27 21:30","2017/5/25 21:30","2017/6/8 21:30","2017/3/7 16:00","2017/3/28 13:00","2017/4/12 16:00","2017/4/19 16:00","2017/4/26 16:00","2017/3/21 15:00","2017/3/14 15:00","2017/4/15 12:30","2017/4/17 14:00","2017/4/18 14:00","2017/3/28 15:00","2017/4/25 15:00","2017/5/23 15:00","2017/4/24 16:00","2017/4/25 16:00","2017/4/26 16:00","2017/5/8 17:00","2017/5/11 17:00","2017/5/3 15:00","2017/6/13 12:00","2017/5/9 15:00","2017/5/24 12:00","2017/6/15 20:00","2017/9/1 16:30","2017/9/13 15:00","2017/10/12 21:30","2017/10/19 21:30","2017/11/2 21:30","2017/11/23 21:30","2017/11/30 21:30","2017/12/7 21:30","2017/10/17 15:00","2017/9/23 12:30","2017/10/2 13:00","2017/10/11 13:00","2017/10/12 13:00","2017/10/23 13:00","2017/10/24 13:00","2017/9/30 12:00","2017/11/6 13:00","2017/11/7 13:00","2017/11/8 13:00","2017/11/9 13:00","2017/11/10 13:00","2017/9/26 15:00","2017/11/8 15:00","2017/10/3 15:00","2017/10/17 15:00","2017/11/21 15:00","2017/10/2 15:00","2017/10/3 15:00","2017/11/7 15:00","2017/11/28 15:00","2017/10/24 15:00","2017/10/25 14:00","2017/11/2 20:30","2017/11/3 20:30","2017/11/4 20:30","2017/11/5 20:30","2017/11/30 20:30","2017/11/28 17:00","2017/11/29 17:00","2017/11/30 17:00","2017/12/1 17:00","2017/12/2 17:00","2018/2/8 18:00","2018/1/9 15:00"]
    var data10 = ["2017/1/11 9:30","2017/1/17 9:30","2017/1/17 9:30","2017/2/13 17:00","2017/2/24 0:00","2017/2/24 0:00","2017/2/24 0:00","2017/2/24 0:00","2017/2/24 0:00","2017/3/1 9:30","2017/3/1 18:00","2017/3/16 9:00","2017/3/16 9:00","2017/3/16 9:00","2017/3/7 9:30","2017/3/7 9:30","2017/3/14 9:30","2017/3/23 9:30","2017/3/23 9:30","2017/3/23 9:30","2017/4/17 9:30","2017/4/17 9:30","2017/4/18 9:30","2017/4/19 9:30","2017/4/20 9:30","2017/5/4 17:00","2017/4/27 8:30","2017/4/27 9:30","2017/5/3 9:30","2017/5/8 8:30","2017/5/24 9:30","2017/5/25 9:30","2017/6/27 0:00","2017/9/1 9:30","2017/9/11 0:00","2017/9/11 0:00","2017/9/11 0:00","2017/9/11 0:00","2017/9/11 0:00","2017/9/11 0:00","2017/9/23 9:30","2017/9/20 9:00","2017/9/20 9:00","2017/9/20 9:00","2017/9/20 9:00","2017/9/20 9:00","2017/9/20 9:00","2017/9/20 9:00","2017/9/21 9:00","2017/9/21 9:00","2017/9/21 9:00","2017/9/29 9:00","2017/9/21 9:00","2017/9/21 9:23","2017/9/21 9:30","2017/9/29 9:00","2017/9/29 9:00","2017/9/29 9:00","2017/9/28 9:00","2017/9/29 9:00","2017/9/29 9:00","2017/9/29 9:00","2017/9/30 9:30","2017/10/1 9:30","2017/10/2 9:30","2017/10/3 9:30","2017/10/4 9:30","2017/10/5 9:30","2017/10/6 9:30","2017/10/7 9:30","2017/10/8 9:30","2017/10/9 9:30","2017/10/10 9:30","2017/10/11 9:30","2018/1/9 9:00","2017/12/25 0:00"]
    var data11 = ["2017/2/17 23:59","2017/1/17 12:00","2017/1/17 12:00","2017/2/14 23:00","2017/3/1 23:59","2017/3/16 12:30","2017/4/26 23:59","2017/5/24 23:59","2017/6/7 23:59","2017/3/6 12:00","2017/3/1 18:00","2017/4/11 12:00","2017/4/18 12:00","2017/4/25 12:00","2017/3/20 15:30","2017/3/13 12:00","2017/4/11 23:59","2017/4/10 12:00","2017/4/10 12:00","2017/3/27 12:00","2017/4/24 12:00","2017/5/22 12:00","2017/4/24 16:00","2017/4/25 16:00","2017/4/26 16:00","2017/5/8 12:00","2017/5/9 17:00","2017/5/3 12:00","2017/6/8 17:00","2017/5/9 12:00","2017/6/1 12:00","2017/6/15 12:00","2017/8/17 12:00","2017/9/10 12:00","2017/10/12 12:00","2017/10/19 12:00","2017/11/2 12:00","2017/11/23 12:00","2017/11/30 12:00","2017/12/7 12:00","2017/10/13 23:00","2017/9/22 17:00","2017/10/1 17:00","2017/10/11 12:00","2017/10/11 12:00","2017/10/22 12:00","2017/10/23 12:00","2017/9/29 12:00","2017/11/5 12:00","2017/11/6 12:00","2017/11/7 12:00","2017/10/3 12:00","2017/11/9 12:00","2017/9/26 12:00","2017/11/1 12:00","2017/10/3 12:00","2017/10/17 12:00","2017/11/21 12:00","2017/10/2 12:00","2017/10/3 12:00","2017/11/7 12:00","2017/11/28 12:00","2017/10/24 9:50","2017/10/25 9:50","2017/10/26 9:50","2017/10/27 9:50","2017/10/28 9:50","2017/10/29 9:50","2017/10/30 9:50","2017/10/31 9:50","2017/11/1 9:50","2017/11/2 9:50","2017/11/3 9:50","2017/11/4 9:50","2018/1/19 17:00","201712/30 23:00"]
    var data12 = ["50","500","250","30","30","0","0","0","0","25","100","30","30","30","75","40","50","100","100","40","40","30","100","100","30","50","60","25","120","40","100","70","120","50","20","20","100","100","100","100","60","25","30","40","30","30","35","35","30","30","30","40","30","25","80","40","40","40","25","25","40","40","80","60","30","42","10","52","40","50","50","60","80","90","36","80"]
    var data13 = ["0","100","200","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","0","150"]
    var data14 = ["學術","休閒娛樂","休閒娛樂","技能","學術","學術","學術","學術","學術","技能","學術","技能","技能","技能","學術","技能","學術","學術","學術","學術","學術","技能","學術","學術","技能","技能","技能","技能","學術","技能","學術","學術","學術","學術","學術","學術","學術","藝文","學術","學術","技能","技能","技能","技能","技能","技能","技能","技能","技能","技能","技能","技能","技能","技能","學術","技能","技能","技能","技能","技能","技能","學術","學術","運動","運動","運動","藝文","運動","藝文","學術","學術","運動","學術","技能","技能","藝文"]
    
    
    @IBOutlet weak var eventTableView: UITableView!
    lazy var ref = Database.database().reference()
    func tableView(_ tableView: UITableView, didSelectRowAt indexPath: IndexPath){
      
        let detailText = storyboard?.instantiateViewController(withIdentifier: "EventDetail") as? EventDetail
        detailText?.titleText = eventData[indexPath.row]
        
        present(detailText!,animated: true,completion: nil)
    }
    
    
    func tableView(_ tableView: UITableView, numberOfRowsInSection section: Int) -> Int {
        return eventData.count
    }
    func tableView(_ tableView: UITableView, cellForRowAt indexPath: IndexPath) -> UITableViewCell {
        var cell:MyCell? = tableView.dequeueReusableCell(withIdentifier: "MyCell") as? MyCell
        if cell == nil {
            cell = UITableViewCell(style: .default,reuseIdentifier: "MyCell") as? MyCell
        }
        cell?.eventName.text = eventData[indexPath.row]
        
        self.ref.child("Name").setValue(eventData)
        self.ref.child("Holder").setValue(data2)
        
        self.ref.child("Contact person").setValue(data3)
        
        self.ref.child("Phone").setValue(data4)
        
        self.ref.child("Lecturer").setValue(data5)
        
        self.ref.child("Location").setValue(data6)
        
        self.ref.child("EventBegin").setValue(data8)
        
        self.ref.child("EventEnd").setValue(data9)
        
        self.ref.child("SignUpBegin").setValue(data10)
        
        self.ref.child("SignUpEnd").setValue(data11)
        
        self.ref.child("Quota").setValue(data12)
        
        self.ref.child("Cost").setValue(data13)
        
        self.ref.child("Category").setValue(data14)
        

        return cell!
    }
    
 
    
       override func viewDidLoad() {
        super.viewDidLoad()
        
        // Do any additional setup after loading the view.
    }

    override func didReceiveMemoryWarning() {
        super.didReceiveMemoryWarning()
        // Dispose of any resources that can be recreated.
    }
    

    /*
    // MARK: - Navigation

    // In a storyboard-based application, you will often want to do a little preparation before navigation
    override func prepare(for segue: UIStoryboardSegue, sender: Any?) {
        // Get the new view controller using segue.destinationViewController.
        // Pass the selected object to the new view controller.
    }
    */

}
