//
//  EventHome.swift
//  proj002
//
//  Created by utaipei on 2018/2/4.
//  Copyright © 2018年 utaipei. All rights reserved.
//

import UIKit
//import Firebase
//import FirebaseDatabase

class EventHome: UIViewController, UITableViewDelegate,UITableViewDataSource,UISearchBarDelegate{
  
    @IBOutlet weak var searchBarbr: UISearchBar!
    
    
    @IBAction func backToEventHome(segue: UIStoryboardSegue){}
    
    //Segmented Control
    
    @IBOutlet weak var changeValue: UISegmentedControl!
    @IBAction func changePage(_ sender: Any) {
//        if changeValue.selectedSegmentIndex != 1{
//            eventData = [((key: "", value: ""), false)]
//            data15 = [:]
//        }else{
//            eventData = ["36": "王俊秀 教授/國立清華大學 講題:【SD to SD:共善作為地球之道】", "5": "臺灣史製作團隊講座 主題【臺灣吧：打造新的學習世界】", "20": "教學助理培訓-時間管理", "34": "邱培榮 創意總監/晶舜設計工程公司 講題:【展示設計與品牌精神】", "52": "乾洗手DIY 病菌不要來！", "19": "教學助理培訓-口語表答關鍵力", "22": "產學合作工作坊", "45": "用iPad開始你的行動教學", "56": "簡報技巧與規劃實務訓練", "60": "攝影棚好好玩", "46": "用iPad翻轉你的教室,你的課堂", "68": "台北風華，深度旅行", "63": "膝關節運動傷害防制與科技輔助", "58": "EverCam & ee-class輕鬆學", "59": "「多媒！多美！多媒體科技新手上路！」", "28": "106年一般環境安全衛生講習", "43": "用Keynote讓你的簡報獨一無二", "44": "用iMovie讓你的影片有聲有色", "72": "亞洲運動保健產業市場發展趨勢", "25": "106年度資訊安全暨個人資料檔案清冊盤點暨風險評鑑教育訓練第一梯次(天母校區)", "26": "106年度資訊安全暨個人資料檔案清冊盤點暨風險評鑑教育訓練第二梯次(博愛校區)", "29": "教學助理培訓-Illustrator 很簡單", "35": "李雨珊 總經理/墨色國際 講題:【從幾米到幾米品牌-幾米品牌的經營策略與創意】", "47": "G-Suite For Education 雲端應用", "16": "臺北市立大學105學年度第2學期理學院數學系科學大師週末研習-統計", "15": "教學助理培訓-微電影剪輯技巧", "33": "106學年度第1學期教師教學工作坊", "69": "運動效能護具與服飾裝備開發趨勢", "2": "臺北市立大學 畢聯會「大發辦桌會」", "74": "第二期iOS APP跨領域合作課程", "3": "1052教師精進研習工作坊(LMS教學)", "21": "善用 EverCam ~ 教學可以更輕鬆、有效!", "10": "105學年度第2學期輔導教師座談會議", "0": "2017東亞數學史國際研討會", "37": "卜袞‧伊斯瑪哈單‧伊斯立端 先生/布農族詩人 講題:【談族語文學創作】", "71": "跑步傷痛防護大調查及自我療護", "65": "運動傷害與防護：輕輕鬆鬆 擺脫痠痛", "17": "【教師精進研討】通識教育這條路─教學經驗分享與省思", "12": "「與時代接軌—影像製作接軌So Fun」-雙機影像剪輯及字幕效果", "41": "讓Apple創造你的無限想像", "23": "產學合作工作坊(4月25日場)", "49": "冬至一起搓湯圓～「哩麥皂！！」", "9": "教學助理培訓-微電影剪輯技巧", "30": "教育系105學年度教育部補助精進師資素質計畫「國民小學適性教學工作坊：模擬教甄」", "13": "「與時代接軌—影像製作接軌So Fun」-影像特效及輸出成品", "61": "自我激勵與潛能發展管理", "64": "膝關節退化的預防與保養方針", "42": "用Mac開始你的創新應用", "8": "美感細胞教育改革計畫陳慕天先生 主題【社會創新】", "6": "南投縣立爽文國中王政忠教導主任 主題【我有一個夢】", "40": "106-1教師教學工作坊-新進教師如何準備教師評鑑", "75": "畢聯會系列講座 系列二：熱血", "7": "教育部師資課程教學與評量協作中心規劃委員汪履維教授 主題【十二年國教的課程教學與評量:改革新動向】", "27": "ZUVIO 雲端即時反饋系統", "39": "陳致宏 博士/德國 維藤·赫德克大學 講題:【從德國民族主義與德國人對古代歷史的觀點談起】", "24": "教學助理培訓-Illustrator 很簡單", "14": "舉行105學年度第2學期全校教師教學研 討會", "54": "106-1教職員工輔導知能研習-情感教育講座之「如何與學生們，談”情”說”愛”」", "73": "天母校區106-1心肺復甦術訓練班", "67": "認識你的身體～身體組成分析測量III", "18": "【教師精進研討】數位教學課程線上經營經驗分享", "48": "告別乾燥～冬季保養品DIY", "62": "106學年度第1學期全校教師教學研習會", "55": "如何完成期末海報", "70": "健身產品設計與產學合作經驗分享", "1": "106年度蘋果節「蘋安喜樂」演唱會暨閉幕典禮", "11": "「與時代接軌—影像製作接軌So Fun」-影像剪接入門及混音", "38": "劉瑞玲 部主任/臺北榮民總醫院眼科部 講題:【現代人常見眼疾及未來隱憂】", "57": "ZUVIO雲端即時系統教學", "50": "醒腦大作戰 萬金油DIY 還可以防蚊喔！", "4": "市立動物園金仕謙園長講座 主題[動物園的保育使命]", "53": "WIX網頁輕鬆學", "66": "手機植物攝影", "51": "矽(珪)藻土吸水杯墊－吸濕又除臭", "31": "「教育學講座」 單文經教授演講：杜威教育思想今詮", "32": "「通識教育與語文教學」暨106學年度第1學期通識教師精進研討會"].map({ str in
//                return (str,false)
//            })
//
//            data15 = ["36": "學術", "5": "學術", "20": "學術", "34": "學術", "52": "技能", "19": "學術", "22": "學術", "45": "技能", "56": "技能", "60": "技能", "46": "技能", "68": "藝文", "63": "運動", "58": "技能", "59": "技能", "28": "學術", "43": "技能", "44": "技能", "72": "學術", "25": "技能", "26": "技能", "29": "技能", "35": "學術", "47": "技能", "16": "學術", "15": "技能", "33": "學術", "69": "學術", "2": "休閒娛樂", "74": "技能", "3": "技能", "21": "技能", "10": "學術", "0": "學術", "37": "藝文", "71": "運動", "65": "運動", "17": "學術", "12": "技能", "41": "技能", "23": "學術", "49": "技能", "9": "技能", "30": "學術", "13": "技能", "61": "學術", "64": "運動", "42": "技能", "8": "學術", "6": "學術", "40": "技能", "75": "藝文", "7": "學術", "27": "技能", "39": "學術", "24": "技能", "14": "學術", "54": "學術", "73": "技能", "67": "運動", "18": "學術", "48": "技能", "62": "學術", "55": "技能", "70": "學術", "1": "休閒娛樂", "11": "技能", "38": "學術", "57": "技能", "50": "技能", "4": "學術", "53": "技能", "66": "藝文", "51": "技能", "31": "學術", "32": "學術"]
//        }
        eventTableView.reloadData()
    }
    
    
    //TableView

    var eventData = ["36": "王俊秀 教授/國立清華大學 講題:【SD to SD:共善作為地球之道】", "5": "臺灣史製作團隊講座 主題【臺灣吧：打造新的學習世界】", "20": "教學助理培訓-時間管理", "34": "邱培榮 創意總監/晶舜設計工程公司 講題:【展示設計與品牌精神】", "52": "乾洗手DIY 病菌不要來！", "19": "教學助理培訓-口語表答關鍵力", "22": "產學合作工作坊", "45": "用iPad開始你的行動教學", "56": "簡報技巧與規劃實務訓練", "60": "攝影棚好好玩", "46": "用iPad翻轉你的教室,你的課堂", "68": "台北風華，深度旅行", "63": "膝關節運動傷害防制與科技輔助", "58": "EverCam & ee-class輕鬆學", "59": "「多媒！多美！多媒體科技新手上路！」", "28": "106年一般環境安全衛生講習", "43": "用Keynote讓你的簡報獨一無二", "44": "用iMovie讓你的影片有聲有色", "72": "亞洲運動保健產業市場發展趨勢", "25": "106年度資訊安全暨個人資料檔案清冊盤點暨風險評鑑教育訓練第一梯次(天母校區)", "26": "106年度資訊安全暨個人資料檔案清冊盤點暨風險評鑑教育訓練第二梯次(博愛校區)", "29": "教學助理培訓-Illustrator 很簡單", "35": "李雨珊 總經理/墨色國際 講題:【從幾米到幾米品牌-幾米品牌的經營策略與創意】", "47": "G-Suite For Education 雲端應用", "16": "臺北市立大學105學年度第2學期理學院數學系科學大師週末研習-統計", "15": "教學助理培訓-微電影剪輯技巧", "33": "106學年度第1學期教師教學工作坊", "69": "運動效能護具與服飾裝備開發趨勢", "2": "臺北市立大學 畢聯會「大發辦桌會」", "74": "第二期iOS APP跨領域合作課程", "3": "1052教師精進研習工作坊(LMS教學)", "21": "善用 EverCam ~ 教學可以更輕鬆、有效!", "10": "105學年度第2學期輔導教師座談會議", "0": "2017東亞數學史國際研討會", "37": "卜袞‧伊斯瑪哈單‧伊斯立端 先生/布農族詩人 講題:【談族語文學創作】", "71": "跑步傷痛防護大調查及自我療護", "65": "運動傷害與防護：輕輕鬆鬆 擺脫痠痛", "17": "【教師精進研討】通識教育這條路─教學經驗分享與省思", "12": "「與時代接軌—影像製作接軌So Fun」-雙機影像剪輯及字幕效果", "41": "讓Apple創造你的無限想像", "23": "產學合作工作坊(4月25日場)", "49": "冬至一起搓湯圓～「哩麥皂！！」", "9": "教學助理培訓-微電影剪輯技巧", "30": "教育系105學年度教育部補助精進師資素質計畫「國民小學適性教學工作坊：模擬教甄」", "13": "「與時代接軌—影像製作接軌So Fun」-影像特效及輸出成品", "61": "自我激勵與潛能發展管理", "64": "膝關節退化的預防與保養方針", "42": "用Mac開始你的創新應用", "8": "美感細胞教育改革計畫陳慕天先生 主題【社會創新】", "6": "南投縣立爽文國中王政忠教導主任 主題【我有一個夢】", "40": "106-1教師教學工作坊-新進教師如何準備教師評鑑", "75": "畢聯會系列講座 系列二：熱血", "7": "教育部師資課程教學與評量協作中心規劃委員汪履維教授 主題【十二年國教的課程教學與評量:改革新動向】", "27": "ZUVIO 雲端即時反饋系統", "39": "陳致宏 博士/德國 維藤·赫德克大學 講題:【從德國民族主義與德國人對古代歷史的觀點談起】", "24": "教學助理培訓-Illustrator 很簡單", "14": "舉行105學年度第2學期全校教師教學研 討會", "54": "106-1教職員工輔導知能研習-情感教育講座之「如何與學生們，談”情”說”愛”」", "73": "天母校區106-1心肺復甦術訓練班", "67": "認識你的身體～身體組成分析測量III", "18": "【教師精進研討】數位教學課程線上經營經驗分享", "48": "告別乾燥～冬季保養品DIY", "62": "106學年度第1學期全校教師教學研習會", "55": "如何完成期末海報", "70": "健身產品設計與產學合作經驗分享", "1": "106年度蘋果節「蘋安喜樂」演唱會暨閉幕典禮", "11": "「與時代接軌—影像製作接軌So Fun」-影像剪接入門及混音", "38": "劉瑞玲 部主任/臺北榮民總醫院眼科部 講題:【現代人常見眼疾及未來隱憂】", "57": "ZUVIO雲端即時系統教學", "50": "醒腦大作戰 萬金油DIY 還可以防蚊喔！", "4": "市立動物園金仕謙園長講座 主題[動物園的保育使命]", "53": "WIX網頁輕鬆學", "66": "手機植物攝影", "51": "矽(珪)藻土吸水杯墊－吸濕又除臭", "31": "「教育學講座」 單文經教授演講：杜威教育思想今詮", "32": "「通識教育與語文教學」暨106學年度第1學期通識教師精進研討會"].map({ str in
        return (str,false)
    })
    
    var data2 = ["36": "學習與媒材設計學系", "5": "學習與媒材設計學系", "20": "教學發展中心", "34": "學習與媒材設計學系", "52": "理學院", "19": "教學發展中心", "22": "研究發展處", "45": "理學院", "56": "教學發展中心", "60": "教學發展中心", "46": "理學院", "68": "國際事務處", "63": "理學院", "58": "教學發展中心", "59": "教學發展中心", "28": "人事室", "43": "理學院", "44": "理學院", "72": "運動器材科技研究所", "25": "計算機與網路中心", "26": "計算機與網路中心", "29": "教學發展中心", "35": "學習與媒材設計學系", "47": "理學院", "16": "數學系", "15": "教學發展中心", "33": "教師專業成長組", "69": "運動器材科技研究所", "2": "課外活動組", "74": "臺北市立大學 教學發展中心計畫辦公室", "3": "教師專業成長組", "21": "教學發展中心", "10": "生活輔導組", "0": "數學系", "37": "學習與媒材設計學系", "71": "運動器材科技研究所", "65": "理學院", "17": "通識教育中心", "12": "教學發展中心", "41": "理學院", "23": "研究發展處", "49": "理學院", "9": "教學發展中心", "30": "教育學系", "13": "教學發展中心", "61": "教學發展中心", "64": "理學院", "42": "理學院", "8": "學習與媒材設計學系", "6": "學習與媒材設計學系", "40": "教學發展中心", "75": "畢聯會", "7": "學習與媒材設計學系", "27": "教學發展中心", "39": "學習與媒材設計學系", "24": "教學發展中心", "14": "教師專業成長組", "54": "分區學務組", "73": "分區學務組", "67": "理學院", "18": "通識教育中心", "48": "理學院", "62": "教學發展中心", "55": "教學發展中心", "70": "運動器材科技研究所", "1": "課外活動組", "11": "教學發展中心", "38": "學習與媒材設計學系", "57": "教學發展中心", "50": "理學院", "4": "學習與媒材設計學系", "53": "教學發展中心", "66": "理學院", "51": "理學院", "31": "教育學系", "32": "通識教育中心"]
    
    var data3 = ["36": "范金雯", "5": "范金雯", "20": "全家蓉", "34": "范金雯", "52": "王蓓芸", "19": "全家蓉", "22": "詹筠慈", "45": "王蓓芸", "56": "全家蓉", "60": "全家蓉", "46": "王蓓芸", "68": "林宜均", "63": "王蓓芸", "58": "全家蓉", "59": "全家蓉", "28": "宋沛盈", "43": "王蓓芸", "44": "王蓓芸", "72": "陳婉菁", "25": "吳性定", "26": "吳性定", "29": "全家蓉", "35": "范金雯", "47": "王蓓芸", "16": "劉俐均", "15": "全家蓉", "33": "曹懷寧", "69": "陳婉菁", "2": "賴明慧", "74": "", "3": "曹懷寧", "21": "全家蓉", "10": "戴坤宏", "0": "劉俐均", "37": "范金雯", "71": "陳婉菁", "65": "王蓓芸", "17": "陳慧芬", "12": "徐美慧", "41": "王蓓芸", "23": "詹筠慈", "49": "王蓓芸", "9": "全家蓉", "30": "簡淑怡", "13": "徐美慧", "61": "全家蓉", "64": "王蓓芸", "42": "王蓓芸", "8": "范金雯", "6": "范金雯", "40": "陶中強", "75": "呂旻育", "7": "范金雯", "27": "全家蓉", "39": "范金雯", "24": "全家蓉", "14": "曹懷寧", "54": "施雅芝", "73": "賴秋君", "67": "王蓓芸", "18": "陳慧芬", "48": "王蓓芸", "62": "曹懷寧", "55": "全家蓉", "70": "陳婉菁", "1": "賴明慧", "11": "徐美慧", "38": "范金雯", "57": "全家蓉", "50": "王蓓芸", "4": "范金雯", "53": "全家蓉", "66": "王蓓芸", "51": "王蓓芸", "31": "簡淑怡", "32": "陳慧芬"]
    
    var data4 = ["36": "02-23113040#8422", "5": "02-23113040#8422", "20": "02-23113040#1862", "34": "02-23113040#8422", "52": "02-23113040#8302", "19": "02-23113040#1862", "22": "2871-8288#7804", "45": "02-23113040#8302", "56": "02-23113040#1862", "60": "02-23113040#1862", "46": "02-23113040#8302", "68": "", "63": "02-23113040#8302", "58": "02-23113040#1862", "59": "02-23113040#1862", "28": "02-87328662", "43": "02-23113040#8302", "44": "02-23113040#8302", "72": "", "25": "02-23113040#8512", "26": "02-23113040#8512", "29": "02-23113040#1862", "35": "02-23113040#8422", "47": "02-23113040#8302", "16": "02-2311-3040*1913", "15": "02-23113040#    1862 ", "33": "0955313998", "69": "", "2": "02-23113040#1221", "74": "", "3": "24576056", "21": "02-23113040#1862", "10": "02-23113040#1212", "0": "02-2311-3040*1913", "37": "02-23113040#8422", "71": "", "65": "", "17": "02-2311-3040*1162", "12": "02-23113040#1821", "41": "02-23113040#8302", "23": "2871-8288#7804", "49": "02-23113040#8302", "9": "02-23113040#1862", "30": "02-23113040*841", "13": "02-23113040#1821", "61": "02-23113040#1862", "64": "02-23113040#8302", "42": "02-23113040#8302", "8": "02-23113040#8422", "6": "02-23113040#8422", "40": "02-23113040#7647", "75": "", "7": "02-23113040#8422", "27": "02-23113040#1862", "39": "02-23113040#8422", "24": "02-23113040#1862", "14": "24576056", "54": "", "73": "", "67": "", "18": "02-2311-3040*1162", "48": "02-23113040#8302", "62": "24576056", "55": "02-23113040#1862", "70": "", "1": "02-23113040#1221", "11": "02-23113040#1821", "38": "02-23113040#8422", "57": "02-23113040#1862", "50": "02-23113040#8302", "4": "02-23113040#8422", "53": "02-23113040#1862", "66": "", "51": "02-23113040#8302", "31": "02-23113040*841", "32": "02-2311-3040*1162"]
    
    var data5 = ["36": "王俊秀 教授/國立清華大學", "5": "張芬芬主任 ", "20": "", "34": "邱培榮 創意總監/晶舜設計工程公司", "52": "", "19": "", "22": "", "45": "", "56": "", "60": "", "46": "", "68": "林文偉老師", "63": "Fenny老師", "58": "", "59": "", "28": "", "43": "", "44": "", "72": "孟瑋琳老師", "25": "陳奕良", "26": "", "29": "洪瑞鍾主任", "35": "李雨珊 總經理/墨色國際", "47": "", "16": "王主任美娟", "15": "", "33": "Elsevier Taiwan office/Rita Ho經理 蔣禮芸組長何家欣副教授 ", "69": "吳承安老師", "2": "", "74": "", "3": "洪瑞鍾主任", "21": "", "10": "", "0": "羅院長義興", "37": "卜袞‧伊斯瑪哈單‧伊斯立端 先生/布農族詩人", "71": "陳思安老師", "65": "David老師", "17": "101年度第五屆 全國通識績優教師亞東技術學院 通識中心林智莉 副教授 ", "12": "何家欣組長", "41": "", "23": "", "49": "", "9": "", "30": "", "13": "何家欣組長", "61": "", "64": "Fenny老師", "42": "", "8": "葉興華教授", "6": "高翠雲教授 ", "40": "", "75": "KID 林柏昇", "7": "張芬芬主任 ", "27": "", "39": "陳致宏 博士/德國 維藤·赫德克大學", "24": "Amy老師", "14": "", "54": "", "73": "吳芬宜老師", "67": "馮威 老師", "18": "103全國通識優良教師 銘傳大學林青蓉主任", "48": "", "62": "李麗晶組長 洪瑞鍾主任黃光獻老師 ", "55": "", "70": "呂文恩老師", "1": "", "11": "何家欣組長", "38": "劉瑞玲 部主任/臺北榮民總醫院眼科部", "57": "", "50": "", "4": "方志華教授 ", "53": "", "66": "陳仁慈老師", "51": "", "31": "中國文化大學師資培育中心 單文經教授 ", "32": ""]

    var data6 = ["36": "本校公誠樓二樓第2會議室", "5": "本校公誠樓二樓第2會議室", "20": "天母校區行政大樓509教室 ", "34": "本校公誠樓二樓第2會議室", "52": "科學館四樓S408 ", "19": "博愛校區行政大樓506教室", "22": "公誠樓第1會議廳", "45": "公誠樓G509教室", "56": "    天母校區科資大樓501電腦教室", "60": "博愛校區公誠樓510攝影棚", "46": "公誠樓G509教室", "68": "科學館四樓S409", "63": "    公誠樓4樓G401教室 ", "58": "博愛校區公誠樓515電腦教室", "59": "博愛校區公誠樓515電腦教室", "28": "本校博愛校區公誠樓2樓第2會議室", "43": "公誠樓G509教室", "44": "公誠樓G509教室", "72": "科學館四樓S410", "25": "    天母校區計網中心科資大樓D501教室 ", "26": "    博愛校區計算機與網路中心公誠樓G521教室 ", "29": "天母校區科資大樓501電腦教室", "35": "本校公誠樓二樓第2會議室", "47": "公誠樓G509教室", "16": "臺北市立大學（博愛校區）行政大樓5樓T506教室", "15": "天母校區科資大樓501電腦教室", "33": "博愛校區公誠樓415研討室 ", "69": "公誠樓G509教室", "2": "臺北市立大學博愛校區操場 ", "74": "", "3": "博愛校區公誠樓401教室 ", "21": "博愛校區公誠樓402教室", "10": "公誠樓2樓第1會議廳", "0": "本校博愛校區公誠樓2樓第一會議室", "37": "本校公誠樓二樓第2會議室", "71": "科學館四樓S409", "65": "    公誠樓4樓G401教室 ", "17": "    博愛校區公誠樓 ", "12": "    公誠樓4樓G401教室 ", "41": "公誠樓G509教室", "23": "科資大樓D810會議室", "49": "公誠樓G509教室", "9": "博愛校區公誠樓515教室", "30": "本校勤樸樓三樓教室", "13": "    公誠樓4樓G401教室 ", "61": "    博愛校區勤樸樓506教室", "64": "    公誠樓4樓G401教室 ", "42": "公誠樓G509教室", "8": "本校公誠樓二樓第2會議室", "6": "本校公誠樓二樓第2會議室", "40": "C611教室", "75": "博愛校區中正堂", "7": "本校公誠樓二樓第2會議室", "27": "博愛校區行政大樓 T509教室", "39": "本校公誠樓二樓第2會議室", "24": "博愛校區公誠樓515教室", "14": "天母校區行政大樓C611教室", "54": "科資大樓D810會議室", "73": "公誠樓G509教室", "67": "科學館四樓S408", "18": "天母校區C617", "48": "科學館四樓S408", "62": "博愛校區藝術館A101演奏廳", "55": "天母校區科資大樓501電腦教室", "70": "科學館四樓S408", "1": "臺北市立大學博愛校區操場 ", "11": "    公誠樓4樓G401教室 ", "38": "本校公誠樓二樓第2會議室", "57": "天母校區行政大樓c509階梯教室", "50": "    科學館四樓S408 ", "4": "本校公誠樓二樓第2會議室", "53": "博愛校區公誠樓515電腦教室", "66": "公誠樓G509教室", "51": "天母校區科資大樓501電腦教室", "31": "    本校公誠樓四樓G415研討室", "32": "天母校區行政大樓C613"]

    var data7 = ["36": "SDtoSD:共善作為地球之道", "5": "", "20": "", "34": "", "52": "", "19": "", "22": "依據本校103-107學年度校務發展計畫「重點方向8：產學合作績效化」所揭示關鍵指標，為提升校內產學合作相關知能，本處特辦理產學合作工作坊。", "45": "", "56": "", "60": "", "46": "", "68": "", "63": "", "58": "", "59": "", "28": "為增加教職員工環境安全衛生觀念，並養成員工隨時注意工作環境可能造成之危害及加強員工安全衛生之本職學能，特辦理旨揭研習活動。", "43": "", "44": "", "72": "", "25": "    個人資料鑑別與盤點訓練課程", "26": "    個人資料鑑別與盤點訓練課程", "29": "", "35": "", "47": "", "16": "修統計玩氣象    貝氏統計的應用", "15": "", "33": "了解投稿國際期刊及教師研究表現-Scopus資料庫應用    善用Scopus掌握研究趨勢與關鍵文獻    LMS教學課程", "69": "", "2": "是畢聯會與學生會合作的活動，為「辦桌」的形式，希望未來畢業生們前途「大發」以及提供一個與師長們的敘舊場所。", "74": "「第二期iOSAPP跨領域合作課程」課程介紹    ＊著重實作，專業業師讓你靠＊    由多位資深UI/UX設計師和iOS開發工程師擔任課程業師，針對同學的學習需求共同規劃課程與授課。我們不講打高空的理論，而更重視讓同學實務操作。    ＊為你的專業扎根，跨領域合作創造更多的亮點＊    在為期14天的課程，透過來自不同專業背景同學的合作、溝通，共同完成一個iOSAPP實作。經由深度參與此課程，每一位同學將可在專業業師的引導下，完整經歷APP的UI/UX設計與開發流程。    ＊關於你的未來，我們已為你想得更多更長遠＊    在此課程後半段，我們將安排兩個隱藏版的課程彩蛋，讓參與的同學能夠與業界接軌。    此課程內容包含UI/UX設計(for設計背景同學)與iOS程式開發(for資訊背景同學)的專業培訓與實作。參與此課程也並不輕鬆，但絕對會很好玩且充滿成就感，比在學校上一學期的課來得更紮實、有料，讓同學實際體驗未來進入業界的工作模式和氛圍。", "3": "", "21": "", "10": "", "0": "", "37": "談族語文學創作", "71": "", "65": "", "17": "", "12": "為協助老師網路教學實施及數位教材製作，提昇網路教學課程品質與推動。以使教學內容能夠更加有效利用及學生回顧吸收。", "41": "", "23": "依據本校103-107學年度校務發展計畫「重點方向8：產學合作績效化」所揭示關鍵指標，為提升校內產學合作相關知能，本處特辦理產學合作工作坊。", "49": "", "9": "", "30": "為提升師資生的適性教學能力，協助在校師資生（以下簡稱在校生）提早認知教師甄試歷程，激勵自發向學的意願，並有效幫助已畢業的師資生（以下簡稱畢業生）展現適性教學知能，順利通過各縣市的教師甄試，成為優秀的國小教師，特辦理本實作工作坊。", "13": "為協助老師網路教學實施及數位教材製作，提昇網路教學課程品質與推動。以使教學內容能夠更加有效利用及學生回顧吸收。", "61": "", "64": "", "42": "", "8": "", "6": "", "40": "", "75": "瘋狂，是大家認識他的第一個印象。    誰的年少不輕狂，又瘋又鬧只為了不枉來過世上一回。如果你認識他是因為他的瘋狂，那麼能否給他一個機會讓你看見他的真誠他的努力？人稱瘋面仔的KID在瘋狂的背後    他背後的努力又有誰知道？    珍惜每次的工作機會    爭取每次的主持工作    拼命賣力努力的付出    用轟轟烈烈的心去感受生命    來自花蓮的林柏昇    在演藝圈闖盪10年的林柏昇    在娛樂百分百有著小乃哥稱號的林柏昇    在綜藝玩很大身為小隊長的林柏昇    追到女神許維恩的林柏昇    受到金鐘獎肯定的林柏昇    不怕累不怕麻煩    如此敬業的態度    每次都用盡全力面對工作    這樣的精神叫人如此敬佩    身為即將是社會新鮮人的我們    在01/09讓林柏昇KID告訴你    他是如何在這世界上用他的熱血闖出自己的一片天！！", "7": "", "27": "", "39": "從德國民族主義與德國人對古代歷史的觀點談起", "24": "", "14": "", "54": "", "73": "", "67": "", "18": "", "48": "", "62": "校長致詞暨新進教師介紹    專題演講:教學分享    綜合座談", "55": "", "70": "", "1": "「2016」年代表字是苦字，因此「2017」希望大家「蘋安喜樂」也成為此次蘋果節演唱會的口號。特別的是，這次因為天母校區世大運關係，沒有場地可用，因此於博愛校區操場，並會由學生會提供遊覽車讓天母的同學們搭乘，來回接送一次。", "11": "為協助老師網路教學實施及數位教材製作，提昇網路教學課程品質與推動。以使教學內容能夠更加有效利用及學生回顧吸收。", "38": "現代人常見眼疾及未來隱憂", "57": "", "50": "", "4": "", "53": "", "66": "", "51": "", "31": "", "32": ""]

    var data8 = ["36": "1.請最遲於演講一天前報名，以利統計人數另準備折疊椅;製作簽到退表...等籌備事宜。2.已商借公誠樓二樓第二會議室座位有限，請報到簽名後自由入座;務必提早10分鐘前報到完畢。3.會場內禁止飲食!4.若需參加活動證明，請於隔週週四之前攜帶學習護照等文件至學材系系辦公室認證及核章（研習章），此講座無法登錄公教人員研習時數且不另製發研習條。5.會後請簽退，並交回問卷予工作人員。", "5": "1.請最遲於演講一天前報名，以利統計人數另準備折疊椅;製作簽到退表...等籌備事宜。2.已商借公誠樓二樓第二會議室座位有限，請報到簽名後自由入座;務必提早10分鐘前報到完畢。3.會場內禁止飲食!4.若需參加活動證明，請於隔週週四之前攜帶學習護照等文件至學材系系辦公室認證及核章（研習章），此講座無法登錄公教人員研習時數且不另製發研習條。", "20": "教學助理優先錄取", "34": "1.請最遲於演講一天前報名，以利統計人數另準備折疊椅;製作簽到退表...等籌備事宜。2.已商借公誠樓二樓第二會議室座位有限，請報到簽名後自由入座;務必提早10分鐘前報到完畢。3.會場內禁止飲食!4.若需參加活動證明，請於隔週週四之前攜帶學習護照等文件至學材系系辦公室認證及核章（研習章），此講座無法登錄公教人員研習時數且不另製發研習條。5.會後請簽退，並交回問卷予工作人員。", "52": "", "19": "教學助理優先錄取", "22": "本次講習不提供午餐，並請自備環保杯。為樽節資源，不印製紙本講義，若有需要請自行攜帶紙筆。", "45": "", "56": "教學助理優先錄取", "60": "教學助理優先錄取", "46": "", "68": "", "63": "", "58": "教學助理優先錄取", "59": "教學助理優先錄取", "28": "", "43": "", "44": "", "72": "", "25": "請勿攜帶食物飲料至電腦教室。", "26": "請勿攜帶食物飲料至電腦教室。", "29": "教學助理優先錄取", "35": "1.請最遲於演講一天前報名，以利統計人數另準備折疊椅;製作簽到退表...等籌備事宜。2.已商借公誠樓二樓第二會議室座位有限，請報到簽名後自由入座;務必提早10分鐘前報到完畢。3.會場內禁止飲食!4.若需參加活動證明，請於隔週週四之前攜帶學習護照等文件至學材系系辦公室認證及核章（研習章），此講座無法登錄公教人員研習時數且不另製發研習條。5.會後請簽退，並交回問卷予工作人員。", "47": "", "16": "", "15": "教學助理優先錄取", "33": "", "69": "", "2": "", "74": "將依報名者線上登錄時間、回傳之「能力需求評估表單」進行審核，額滿後停止招生。報名完成後，本中心將e-mail「能力需求評估表單」至您的信箱，敬請務必於本中心寄信日期3天內完成能力評估並提交表單，逾期恕不接受報名。", "3": "", "21": "", "10": "", "0": "一、本校停車位有限,請儘量搭乘大眾交通工具,不辦理停車服務。二、請準時參與議程、遵守議事規則發言、維持會場秩序。三、請配合本校環境清潔與珍惜資源規定:(一)本校區全面禁止吸煙。(二)請自備環保杯。(三)活動期間請維護環境清潔。", "37": "1.請最遲於演講一天前報名，以利統計人數另準備折疊椅;製作簽到退表...等籌備事宜。2.已商借公誠樓二樓第二會議室座位有限，請報到簽名後自由入座;務必提早10分鐘前報到完畢。3.會場內禁止飲食!4.若需參加活動證明，請於隔週週四之前攜帶學習護照等文件至學材系系辦公室認證及核章（研習章），此講座無法登錄公教人員研習時數且不另製發研習條。5.會後請簽退，並交回問卷予工作人員。", "71": "", "65": "", "17": "", "12": "煩請老師攜帶筆電，以利後續課程操作及教材製作使用。", "41": "", "23": "本次參與者每一場次將採計研習時數2小時。本次講習不提供午餐，並請自備環保杯。為樽節資源，不印製紙本講義，若有需要請自行攜帶紙筆。請於報名時註記參加場次", "49": "", "9": "教學助理優先錄取", "30": "1.第一場6月3日（星期六）：以本（105B）學期修習教育學系「教學語言與溝通」的在校生為優先，其餘在校生自由報名，總人數限40人以內，依報名先後順序錄取之。2.第二場6月4日（星期日）：凡本校畢業生，今（106）年報名參加各縣市國小教師甄試者為優先，其餘的畢業生自由報名，總人數以25人為原則，以報名先後順序錄取之。3.時間：每日上午9:00-12:00，下午1:30-4:30，其間10:15-10:30和2:45-3:00為中場休息時間。4.歡迎前述兩類報名而未錄取者及其餘在校生和畢業生以觀摩者身分參與學習，每試場觀摩人數以10人為限，觀摩時須配合活動作息，不得中途進出，且須全程保持安靜。5.因報名人數踴躍，場地及師資無法容納，有可能提前截止報名6.研習場地為勤樸樓三樓。", "13": "煩請老師攜帶筆電，以利後續課程操作及教材製作使用。", "61": "教學助理優先錄取", "64": "", "42": "", "8": "1.請最遲於演講一天前報名，以利統計人數另準備折疊椅;製作簽到退表...等籌備事宜。2.已商借公誠樓二樓第二會議室座位有限，請報到簽名後自由入座;務必提早10分鐘前報到完畢。3.會場內禁止飲食!4.若需參加活動證明，請於隔週週四之前攜帶學習護照等文件至學材系系辦公室認證及核章（研習章），此講座無法登錄公教人員研習時數且不另製發研習條。", "6": "1.請最遲於演講一天前報名，以利統計人數另準備折疊椅;製作簽到退表...等籌備事宜。2.已商借公誠樓二樓第二會議室座位有限，請報到簽名後自由入座;務必提早10分鐘前報到完畢。3.會場內禁止飲食!4.若需參加活動證明，請於隔週週四之前攜帶學習護照等文件至學材系系辦公室認證及核章（研習章），此講座無法登錄公教人員研習時數且不另製發研習條。", "40": "", "75": "KID現場還會不定時的贈送周邊禮物商品喔！！", "7": "1.請最遲於演講一天前報名，以利統計人數另準備折疊椅;製作簽到退表...等籌備事宜。2.已商借公誠樓二樓第二會議室座位有限，請報到簽名後自由入座;務必提早10分鐘前報到完畢。3.會場內禁止飲食!4.若需參加活動證明，請於隔週週四之前攜帶學習護照等文件至學材系系辦公室認證及核章（研習章），此講座無法登錄公教人員研習時數且不另製發研習條。", "27": "煩請攜帶智慧型手機、平版或筆記型電腦，以利後續課程操作及教材製作使用。", "39": "1.請最遲於演講一天前報名，以利統計人數另準備折疊椅;製作簽到退表...等籌備事宜。2.已商借公誠樓二樓第二會議室座位有限，請報到簽名後自由入座;務必提早10分鐘前報到完畢。3.會場內禁止飲食!4.若需參加活動證明，請於隔週週四之前攜帶學習護照等文件至學材系系辦公室認證及核章（研習章），此講座無法登錄公教人員研習時數且不另製發研習條。5.會後請簽退，並交回問卷予工作人員。", "24": "教學助理優先錄取", "14": "", "54": "本研習提供研習時數2小時(響應環保，需紙本研習證書者，麻煩特別註明，謝謝您的配合)", "73": "", "67": "", "18": "", "48": "", "62": "", "55": "教學助理優先錄取", "70": "", "1": "蘋安喜樂」演唱會為公開場地，因此只有搖滾區同學需要收票，注意紅線隔開搖滾區以外之同學，且搖滾區憑票根可抽獎，與藝人當場互動拍照，注意安全、人潮擠壓等問題。「蘋安喜樂」演唱會後台，會有學生會成員與藝人做兩分鐘快問快答的活動，注意藝人到達時間及演唱時間，不要拖時。「蘋安喜樂」演唱會途中，會有抽獎箱，讓藝人抽出小禮品或拍照資格，若是小禮品則由學生會成員邀請該同學上台當場向藝人朋友領取；若為拍照資格，則一樣由學生會成員邀請該同學上台，並由學生會成員拍攝當場與藝人朋友合照。", "11": "煩請老師攜帶筆電，以利後續課程操作及教材製作使用。", "38": "1.請最遲於演講一天前報名，以利統計人數另準備折疊椅;製作簽到退表...等籌備事宜。2.已商借公誠樓二樓第二會議室座位有限，請報到簽名後自由入座;務必提早10分鐘前報到完畢。3.會場內禁止飲食!4.若需參加活動證明，請於隔週週四之前攜帶學習護照等文件至學材系系辦公室認證及核章（研習章），此講座無法登錄公教人員研習時數且不另製發研習條。5.會後請簽退，並交回問卷予工作人員。", "57": "教學助理優先錄取", "50": "", "4": "1.請最遲於演講一天前報名，以利統計人數另準備折疊椅;製作簽到退表...等籌備事宜。2.已商借公誠樓二樓第二會議室座位有限，請報到簽名後自由入座;務必提早10分鐘前報到完畢。3.會場內禁止飲食!4.若需參加活動證明，請於隔週週四之前攜帶學習護照等文件至學材系系辦公室認證及核章（研習章），此講座無法登錄公教人員研習時數且不另製發研習條。", "53": "教學助理優先錄取", "66": "", "51": "", "31": "1.若需參加活動證明，請於106年6月23日(五)之前攜帶學習護照等文件至公誠樓四樓教育學系辦公室認證及核章（研習章）。2.此講座無法登錄公教人員研習時數且不另製發研習條。", "32": ""]
    
    var data9 = ["36": "2017/11/2 18:30", "5": "2017/3/16 18:30", "20": "2017/4/25 13:00", "34": "2017/10/12 18:30", "52": "2017/11/10 12:00", "19": "2017/3/28 13:00", "22": "2017/4/24 14:00", "45": "2017/10/23 12:00", "56": "2017/10/17 13:00", "60": "2017/11/7 13:00", "46": "2017/10/24 12:00", "68": "2017/11/30 18:30", "63": "2017/10/25 12:00", "58": "2017/10/2 13:00", "59": "2017/10/3 13:00", "28": "2017/6/13 9:00", "43": "2017/10/11 12:00", "44": "2017/10/12 12:00", "72": "2017/12/1 13:00", "25": "2017/5/8 14:00", "26": "2017/5/11 14:00", "29": "2017/5/8 13:00", "35": "2017/10/19 18:30", "47": "2017/9/30 9:00", "16": "2017/4/15 8:30", "15": "2017/3/14 13:00", "33": "2017/9/13 13:00", "69": "2017/11/28 13:00", "2": "2017/1/17 9:30", "74": "2018/1/23 10:00", "3": "2017/2/15 13:30", "21": "2017/5/23 13:00", "10": "2017/3/28 12:00", "0": "2017/2/23 9:00", "37": "2017/11/23 18:03", "71": "2017/11/30 13:00", "65": "2017/11/3 18:30", "17": "2017/4/17 12:00", "12": "2017/4/19 14:00", "41": "2017/9/23 9:30", "23": "2017/4/25 9:30", "49": "2017/11/7 12:00", "9": "2017/3/7 13:00", "30": "2017/5/24 9:30", "13": "2017/4/26 14:00", "61": "2017/11/28 13:00", "64": "2017/11/2 18:30", "42": "2017/10/2 12:00", "8": "2017/6/8 18:30", "6": "2017/4/27 18:30", "40": "2017/10/17 13:00", "75": "2018/1/9 13:00", "7": "2017/5/25 18:30", "27": "2017/5/3 13:00", "39": "2017/12/7 18:30", "24": "2017/4/26 9:30", "14": "2017/3/21 12:00", "54": "2017/11/8 13:00", "73": "2017/12/2 13:00", "67": "2017/11/5 18:30", "18": "2017/4/18 12:00", "48": "2017/11/6 12:00", "62": "2017/10/24 12:00", "55": "2017/10/3 13:00", "70": "2017/11/29 13:00", "1": "2017/1/17 9:30", "11": "2017/4/12 14:00", "38": "2017/11/30 18:30", "57": "2017/11/21 13:00", "50": "2017/11/8 12:00", "4": "2017/3/2 18:30", "53": "2017/9/26 13:00", "66": "2017/11/4 18:30", "51": "2017/11/9 12:00", "31": "2017/6/15 18:30", "32": "2017/9/1 9:30"]

    
    var data10 = ["36": "2017/11/2 21:30", "5": "2017/3/16 21:30", "20": "2017/4/25 15:00", "34": "2017/10/12 21:30", "52": "2017/11/10 13:00", "19": "2017/3/28 15:00", "22": "2017/4/24 16:00", "45": "2017/10/23 13:00", "56": "2017/10/17 15:00", "60": "2017/11/7 15:00", "46": "2017/10/24 13:00", "68": "2017/11/30 20:30", "63": "2017/10/25 14:00", "58": "2017/10/2 15:00", "59": "2017/10/3 15:00", "28": "2017/6/13 12:00", "43": "2017/10/11 13:00", "44": "2017/10/12 13:00", "72": "2017/12/1 17:00", "25": "2017/5/8 17:00", "26": "2017/5/11 17:00", "29": "2017/5/9 15:00", "35": "2017/10/19 21:30", "47": "2017/9/30 12:00", "16": "2017/4/15 12:30", "15": "2017/3/14 15:00", "33": "2017/9/13 15:00", "69": "2017/11/28 17:00", "2": "2017/1/17 12:00", "74": "2018/2/8 18:00", "3": "2017/2/15 14:30", "21": "2017/5/23 15:00", "10": "2017/3/28 13:00", "0": "2017/2/23 18:00", "37": "2017/11/23 21:30", "71": "2017/11/30 17:00", "65": "2017/11/3 20:30", "17": "2017/4/17 14:00", "12": "2017/4/19 16:00", "41": "2017/9/23 12:30", "23": "2017/4/25 16:00", "49": "2017/11/7 13:00", "9": "2017/3/7 16:00", "30": "2017/5/24 12:00", "13": "2017/4/26 16:00", "61": "2017/11/28 15:00", "64": "2017/11/2 20:30", "42": "2017/10/2 13:00", "8": "2017/6/8 21:30", "6": "2017/4/27 21:30", "40": "2017/10/17 15:00", "75": "2018/1/9 15:00", "7": "2017/5/25 21:30", "27": "2017/5/3 15:00", "39": "2017/12/7 21:30", "24": "2017/4/26 16:00", "14": "2017/3/21 15:00", "54": "2017/11/8 15:00", "73": "2017/12/2 17:00", "67": "2017/11/5 20:30", "18": "2017/4/18 14:00", "48": "2017/11/6 13:00", "62": "2017/10/24 15:00", "55": "2017/10/3 15:00", "70": "2017/11/29 17:00", "1": "2017/1/17 12:00", "11": "2017/4/12 16:00", "38": "2017/11/30 21:30", "57": "2017/11/21 15:00", "50": "2017/11/8 13:00", "4": "2017/3/2 21:30", "53": "2017/9/26 15:00", "66": "2017/11/4 20:30", "51": "2017/11/9 13:00", "31": "2017/6/15 20:00", "32": "2017/9/1 16:30"]

    
    var data11 = ["36": "2017/9/11 0:00", "5": "2017/2/24 0:00", "20": "2017/4/17 9:30", "34": "2017/9/11 0:00", "52": "2017/9/21 9:00", "19": "2017/3/23 9:30", "22": "2017/4/18 9:30", "45": "2017/9/20 9:00", "56": "2017/9/29 9:00", "60": "2017/9/29 9:00", "46": "2017/9/20 9:00", "68": "2017/10/6 9:30", "63": "2017/10/1 9:30", "58": "2017/9/28 9:00", "59": "2017/9/29 9:00", "28": "2017/5/3 9:30", "43": "2017/9/20 9:00", "44": "2017/9/20 9:00", "72": "2017/10/10 9:30", "25": "2017/5/4 17:00", "26": "2017/4/27 8:30", "29": "2017/5/8 8:30", "35": "2017/9/11 0:00", "47": "2017/9/20 9:00", "16": "2017/3/14 9:30", "15": "2017/3/7 9:30", "33": "2017/9/1 9:30", "69": "2017/10/7 9:30", "2": "2017/1/17 9:30", "74": "2018/1/9 9:00", "3": "2017/2/13 17:00", "21": "2017/4/17 9:30", "10": "2017/3/1 18:00", "0": "2017/1/11 9:30", "37": "2017/9/11 0:00", "71": "2017/10/9 9:30", "65": "2017/10/3 9:30", "17": "2017/3/23 9:30", "12": "2017/3/16 9:00", "41": "2017/9/20 9:00", "23": "2017/4/19 9:30", "49": "2017/9/21 9:00", "9": "2017/3/1 9:30", "30": "2017/5/24 9:30", "13": "2017/3/16 9:00", "61": "2017/9/29 9:00", "64": "2017/10/2 9:30", "42": "2017/9/20 9:00", "8": "2017/2/24 0:00", "6": "2017/2/24 0:00", "40": "2017/9/23 9:30", "75": "2017/12/25 0:00", "7": "2017/2/24 0:00", "27": "2017/4/27 9:30", "39": "2017/9/11 0:00", "24": "2017/4/20 9:30", "14": "2017/3/7 9:30", "54": "2017/9/21 9:30", "73": "2017/10/11 9:30", "67": "2017/10/5 9:30", "18": "2017/3/23 9:30", "48": "2017/9/21 9:00", "62": "2017/9/30 9:30", "55": "2017/9/29 9:00", "70": "2017/10/8 9:30", "1": "2017/1/17 9:30", "11": "2017/3/16 9:00", "38": "2017/9/11 0:00", "57": "2017/9/29 9:00", "50": "2017/9/21 9:00", "4": "2017/2/24 0:00", "53": "2017/9/21 9:23", "66": "2017/10/4 9:30", "51": "2017/9/29 9:00", "31": "2017/5/25 9:30", "32": "2017/6/27 0:00"]

    
    var data12 = ["36": "2017/11/2 12:00", "5": "2017/3/16 12:30", "20": "2017/4/24 12:00", "34": "2017/10/12 12:00", "52": "2017/11/9 12:00", "19": "2017/3/27 12:00", "22": "2017/4/24 16:00", "45": "2017/10/22 12:00", "56": "2017/10/17 12:00", "60": "2017/11/7 12:00", "46": "2017/10/23 12:00", "68": "2017/10/30 9:50", "63": "2017/10/25 9:50", "58": "2017/10/2 12:00", "59": "2017/10/3 12:00", "28": "2017/6/8 17:00", "43": "2017/10/11 12:00", "44": "2017/10/11 12:00", "72": "2017/11/3 9:50", "25": "2017/5/8 12:00", "26": "2017/5/9 17:00", "29": "2017/5/9 12:00", "35": "2017/10/19 12:00", "47": "2017/9/29 12:00", "16": "2017/4/11 23:59", "15": "2017/3/13 12:00", "33": "2017/9/10 12:00", "69": "2017/10/31 9:50", "2": "2017/1/17 12:00", "74": "2018/1/19 17:00", "3": "2017/2/14 23:00", "21": "2017/5/22 12:00", "10": "2017/3/1 18:00", "0": "2017/2/17 23:59", "37": "2017/11/23 12:00", "71": "2017/11/2 9:50", "65": "2017/10/27 9:50", "17": "2017/4/10 12:00", "12": "2017/4/18 12:00", "41": "2017/9/22 17:00", "23": "2017/4/25 16:00", "49": "2017/11/6 12:00", "9": "2017/3/6 12:00", "30": "2017/6/1 12:00", "13": "2017/4/25 12:00", "61": "2017/11/28 12:00", "64": "2017/10/26 9:50", "42": "2017/10/1 17:00", "8": "2017/6/7 23:59", "6": "2017/4/26 23:59", "40": "2017/10/13 23:00", "75": "201712/30 23:00", "7": "2017/5/24 23:59", "27": "2017/5/3 12:00", "39": "2017/12/7 12:00", "24": "2017/4/26 16:00", "14": "2017/3/20 15:30", "54": "2017/11/1 12:00", "73": "2017/11/4 9:50", "67": "2017/10/29 9:50", "18": "2017/4/10 12:00", "48": "2017/11/5 12:00", "62": "2017/10/24 9:50", "55": "2017/10/3 12:00", "70": "2017/11/1 9:50", "1": "2017/1/17 12:00", "11": "2017/4/11 12:00", "38": "2017/11/30 12:00", "57": "2017/11/21 12:00", "50": "2017/11/7 12:00", "4": "2017/3/1 23:59", "53": "2017/9/26 12:00", "66": "2017/10/28 9:50", "51": "2017/10/3 12:00", "31": "2017/6/15 12:00", "32": "2017/8/17 12:00"]

    
    var data13 = ["36": "100人", "5": "0人", "20": "40人", "34": "20人", "52": "30人", "19": "40人", "22": "100人", "45": "30人", "56": "40人", "60": "40人", "46": "35人", "68": "40人", "63": "60人", "58": "25人", "59": "25人", "28": "120人", "43": "40人", "44": "30人", "72": "80人", "25": "50人", "26": "60人", "29": "40人", "35": "20人", "47": "35人", "16": "50人", "15": "40人", "33": "50人", "69": "50人", "2": "250人", "74": "36人", "3": "30人", "21": "30人", "10": "100人", "0": "50人", "37": "100人", "71": "60人", "65": "42人", "17": "100人", "12": "30人", "41": "25人", "23": "100人", "49": "30人", "9": "25人", "30": "100人", "13": "30人", "61": "40人", "64": "30人", "42": "30人", "8": "0人", "6": "0人", "40": "60人", "75": "80人", "7": "0人", "27": "25人", "39": "100人", "24": "30人", "14": "75人", "54": "80人", "73": "90人", "67": "52人", "18": "100人", "48": "30人", "62": "80人", "55": "40人", "70": "50人", "1": "500人", "11": "30人", "38": "100人", "57": "40人", "50": "30人", "4": "30人", "53": "25人", "66": "10人", "51": "40人", "31": "70人", "32": "120人"]
    
    var data14 = ["36": "免費", "5": "免費", "20": "免費", "34": "免費", "52": "免費", "19": "免費", "22": "免費", "45": "免費", "56": "免費", "60": "免費", "46": "免費", "68": "免費", "63": "免費", "58": "免費", "59": "免費", "28": "免費", "43": "免費", "44": "免費", "72": "免費", "25": "免費", "26": "免費", "29": "免費", "35": "免費", "47": "免費", "16": "免費", "15": "免費", "33": "免費", "69": "免費", "2": "$200", "74": "免費", "3": "免費", "21": "免費", "10": "免費", "0": "免費", "37": "免費", "71": "免費", "65": "免費", "17": "免費", "12": "免費", "41": "免費", "23": "免費", "49": "免費", "9": "免費", "30": "免費", "13": "免費", "61": "免費", "64": "免費", "42": "免費", "8": "免費", "6": "免費", "40": "免費", "75": "$150", "7": "免費", "27": "免費", "39": "免費", "24": "免費", "14": "免費", "54": "免費", "73": "免費", "67": "免費", "18": "免費", "48": "免費", "62": "免費", "55": "免費", "70": "免費", "1": "$100", "11": "免費", "38": "免費", "57": "免費", "50": "免費", "4": "免費", "53": "免費", "66": "免費", "51": "免費", "31": "免費", "32": "免費"]

    
    var data15 = ["36": "學術", "5": "學術", "20": "學術", "34": "學術", "52": "技能", "19": "學術", "22": "學術", "45": "技能", "56": "技能", "60": "技能", "46": "技能", "68": "藝文", "63": "運動", "58": "技能", "59": "技能", "28": "學術", "43": "技能", "44": "技能", "72": "學術", "25": "技能", "26": "技能", "29": "技能", "35": "學術", "47": "技能", "16": "學術", "15": "技能", "33": "學術", "69": "學術", "2": "休閒娛樂", "74": "技能", "3": "技能", "21": "技能", "10": "學術", "0": "學術", "37": "藝文", "71": "運動", "65": "運動", "17": "學術", "12": "技能", "41": "技能", "23": "學術", "49": "技能", "9": "技能", "30": "學術", "13": "技能", "61": "學術", "64": "運動", "42": "技能", "8": "學術", "6": "學術", "40": "技能", "75": "藝文", "7": "學術", "27": "技能", "39": "學術", "24": "技能", "14": "學術", "54": "學術", "73": "技能", "67": "運動", "18": "學術", "48": "技能", "62": "學術", "55": "技能", "70": "學術", "1": "休閒娛樂", "11": "技能", "38": "學術", "57": "技能", "50": "技能", "4": "學術", "53": "技能", "66": "藝文", "51": "技能", "31": "學術", "32": "學術"]
    var daysss = [33,98,78,57,29,75,26,41,19,76,85,25,63,53,82,45,67,5,10,43,79,70,69,20,56,24,97,46,62,34,16,99,91,55,11,50,39,92,33,98,78,57,29,75,26,41,19,76,85,25,63,53,82,45,67,5,10,43,79,70,69,20,56,24,97,46,62,34,16,99,91,55,11,50,39,92]
    var data16 = [28,21,17,23,11,18,29,14,25,26,24,16,15,30,12,13,22,27,10,28,21,17,23,11,18,29,14,25,26,24,16,15,30,12,13,22,27,10,28,21,17,23,11,18,29,14,25,26,24,16,15,30,12,13,22,27,10,28,21,17,23,11,18,29,14,25,26,24,16,15,30,12,13,22,27,10]
    
    
    @IBOutlet weak var eventTableView: UITableView!
//    lazy var ref = Database.database().reference()
    
    func tableView(_ tableView: UITableView, heightForRowAt indexPath: IndexPath) -> CGFloat {
        return 150
    }
    
    func tableView(_ tableView: UITableView, didSelectRowAt indexPath: IndexPath){
        let detail = storyboard?.instantiateViewController(withIdentifier: "EventDetailNavi") as? EventDetailNavi
        let isOdd = indexPath.row % 2 == 1
        let isOddStr = String(describing: isOdd)
        detail?.eventData = [
            "name" : eventData[indexPath.row].0.value ,
            "successOrfail" : isOddStr,
            "timeStart" : data9[String(indexPath.row)]!,
            "timeEnd" : data10[String(indexPath.row)]!,
            "place" : data6[String(indexPath.row)]!,
            "holder" : data2[String(indexPath.row)]!,
            "contant" : data7[String(indexPath.row)]!,
            "register" : data8[String(indexPath.row)]!,
            "registerDate" : data12[String(indexPath.row)]!,
            "number2" : data13[String(indexPath.row)]!,
            "number" : String(data16[indexPath.row])
        ]
        present(detail!,animated: true,completion: nil)
    }
    
    func tableView(_ tableView: UITableView, numberOfRowsInSection section: Int) -> Int {
        if isSearching{
            return fliteredData.count
        }else{
            return eventData.count
        }
        
    }
    func tableView(_ tableView: UITableView, cellForRowAt indexPath: IndexPath) -> UITableViewCell {
//        var cell:UITableViewCell? = tableView.dequeueReusableCell(withIdentifier: "MyCell")
//        if cell == nil {
//            cell = UITableViewCell(style: .default,reuseIdentifier: "MyCell")
//        }
//        cell?.textLabel?.text = eventData[String(indexPath.row)]!
        
        var cell = tableView.dequeueReusableCell(withIdentifier: "Mycell") as? MyCell
        
        if cell == nil {
            cell = MyCell(style: .default, reuseIdentifier: "Mycell")
        }
        
        
        if changeValue.selectedSegmentIndex != 1{
            cell?.label.text = ""
            cell?.label2.text = ""
            cell?.label3.text = ""
            cell?.label4.text = ""
            cell?.okButton.setTitle("", for: .normal)
        }else{
            if isSearching {
                cell?.label.text = fliteredData[indexPath.row]
            }else{
                cell?.label.text = eventData[indexPath.row].0.value
            }
            cell?.label2.text = data15[String(indexPath.row)]!
            cell?.label3.text = data9[String(indexPath.row)]!
            cell?.label4.text = "活動倒數剩餘" + String(daysss[indexPath.row]) + "天"
        }
        
        cell?.int = indexPath.row
        
        if eventData[indexPath.row].1{
            cell?.okButton.setTitle("selected", for: .normal)
        }else {
            cell?.okButton.setTitle("select", for: .normal)
        }
        
        return cell!
        
//        self.ref.child("Name").setValue(eventData)
//        self.ref.child("Holder").setValue(data2)
//        
//        self.ref.child("Contact person").setValue(data3)
//        
//        self.ref.child("Phone").setValue(data4)
//        
//        self.ref.child("Lecturer").setValue(data5)
//        
//        self.ref.child("Location").setValue(data6)
//        
//        self.ref.child("EventBegin").setValue(data8)
//        
//        self.ref.child("EventEnd").setValue(data9)
//        
//        self.ref.child("SignUpBegin").setValue(data10)
//        
//        self.ref.child("SignUpEnd").setValue(data11)
//        
//        self.ref.child("Quota").setValue(data12)
//        
//        self.ref.child("Cost").setValue(data13)
//        
//        self.ref.child("Category").setValue(data14)
//        

//        return cell!
    }
    var fliteredData = [String]()
    var eventData1 = ["王俊秀 教授/國立清華大學 講題:【SD to SD:共善作為地球之道】", "「通識教育與語文教學」暨106學年度第1學期通識教師精進研討會", "教學助理培訓-時間管理", "邱培榮 創意總監/晶舜設計工程公司 講題:【展示設計與品牌精神】", "乾洗手DIY 病菌不要來！", "教學助理培訓-口語表答關鍵力", "產學合作工作坊", "用iPad開始你的行動教學", "簡報技巧與規劃實務訓練", "攝影棚好好玩", "用iPad翻轉你的教室,你的課堂", "台北風華，深度旅行", "膝關節運動傷害防制與科技輔助", "EverCam & ee-class輕鬆學", "「多媒！多美！多媒體科技新手上路！」", "106年一般環境安全衛生講習", "用Keynote讓你的簡報獨一無二", "用iMovie讓你的影片有聲有色", "亞洲運動保健產業市場發展趨勢", "106年度資訊安全暨個人資料檔案清冊盤點暨風險評鑑教育訓練第一梯次(天母校區)", "106年度資訊安全暨個人資料檔案清冊盤點暨風險評鑑教育訓練第二梯次(博愛校區)", "教學助理培訓-Illustrator 很簡單", "李雨珊 總經理/墨色國際 講題:【從幾米到幾米品牌-幾米品牌的經營策略與創意】", "G-Suite For Education 雲端應用", "臺北市立大學105學年度第2學期理學院數學系科學大師週末研習-統計", "教學助理培訓-微電影剪輯技巧", "106學年度第1學期教師教學工作坊", "運動效能護具與服飾裝備開發趨勢", "臺北市立大學 畢聯會「大發辦桌會」", "第二期iOS APP跨領域合作課程", "1052教師精進研習工作坊(LMS教學)", "善用 EverCam ~ 教學可以更輕鬆、有效!", "105學年度第2學期輔導教師座談會議", "2017東亞數學史國際研討會", "卜袞‧伊斯瑪哈單‧伊斯立端 先生/布農族詩人 講題:【談族語文學創作】", "跑步傷痛防護大調查及自我療護", "運動傷害與防護：輕輕鬆鬆 擺脫痠痛", "【教師精進研討】通識教育這條路─教學經驗分享與省思", "「與時代接軌—影像製作接軌So Fun」-雙機影像剪輯及字幕效果", "讓Apple創造你的無限想像", "產學合作工作坊(4月25日場)", "冬至一起搓湯圓～「哩麥皂！！」", "教學助理培訓-微電影剪輯技巧", "教育系105學年度教育部補助精進師資素質計畫「國民小學適性教學工作坊：模擬教甄」", "「與時代接軌—影像製作接軌So Fun」-影像特效及輸出成品", "自我激勵與潛能發展管理", "膝關節退化的預防與保養方針", "用Mac開始你的創新應用", "美感細胞教育改革計畫陳慕天先生 主題【社會創新】", "南投縣立爽文國中王政忠教導主任 主題【我有一個夢】", "106-1教師教學工作坊-新進教師如何準備教師評鑑", "畢聯會系列講座 系列二：熱血", "教育部師資課程教學與評量協作中心規劃委員汪履維教授 主題【十二年國教的課程教學與評量:改革新動向】", "ZUVIO 雲端即時反饋系統", "陳致宏 博士/德國 維藤·赫德克大學 講題:【從德國民族主義與德國人對古代歷史的觀點談起】", "教學助理培訓-Illustrator 很簡單", "舉行105學年度第2學期全校教師教學研 討會", "106-1教職員工輔導知能研習-情感教育講座之「如何與學生們，談”情”說”愛”」", "天母校區106-1心肺復甦術訓練班", "認識你的身體～身體組成分析測量III", "【教師精進研討】數位教學課程線上經營經驗分享", "告別乾燥～冬季保養品DIY", "106學年度第1學期全校教師教學研習會", "如何完成期末海報", "健身產品設計與產學合作經驗分享", "106年度蘋果節「蘋安喜樂」演唱會暨閉幕典禮", "「與時代接軌—影像製作接軌So Fun」-影像剪接入門及混音", "劉瑞玲 部主任/臺北榮民總醫院眼科部 講題:【現代人常見眼疾及未來隱憂】", "ZUVIO雲端即時系統教學", "醒腦大作戰 萬金油DIY 還可以防蚊喔！", "市立動物園金仕謙園長講座 主題[動物園的保育使命]", "WIX網頁輕鬆學", "手機植物攝影", "矽(珪)藻土吸水杯墊－吸濕又除臭", "「教育學講座」 單文經教授演講：杜威教育思想今詮", "臺灣史製作團隊講座 主題【臺灣吧：打造新的學習世界】"]

    var isSearching = false
    func searchBar(_ searchBar: UISearchBar, textDidChange searchText: String) {
        if searchBarbr.text == nil || searchBarbr.text == "" {
            isSearching = false
            view.endEditing(true)
        }else{
            isSearching = true
            fliteredData = eventData1.filter({$0 == searchBarbr.text})
        }
        eventTableView.reloadData()
    }
    
    override func viewDidLoad() {
        super.viewDidLoad()
        searchBarbr.delegate = self
        searchBarbr.returnKeyType = UIReturnKeyType.done
       
        let color1 = UIColor(red: 1,green: 1,blue: 235/255,alpha: 1)
        let color2 = UIColor(red: 253/255,green: 186/255,blue: 165/255,alpha: 1)
        
        let gradient = CAGradientLayer()
        gradient.frame = self.view.frame
        gradient.colors = [color1.cgColor,color2.cgColor]
        
        self.view.layer.insertSublayer(gradient, at: 0)
        // Do any additional setup after loading the view.
    }

    override func didReceiveMemoryWarning() {
        super.didReceiveMemoryWarning()
        // Dispose of any resources that can be recreated.
    }
    

    /*
    // MARK: - Navigation

    // In a storyboard-based application, you will often want to do a little preparation before navigation
    override func prepare(for segue: UIStoryboardSegue, sender: Any?) {
        // Get the new view controller using segue.destinationViewController.
        // Pass the selected object to the new view controller.
    }
    */

}
